000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BAD03.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
      *    This program displays a message.
000600 PROGRAM-BEGIN.
000700     DISPLAY "I'm really bad!".
000800 PROGRAM-DONE.
000900     STOP RUN.
