      *exercise 1, chapter 1
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "I am a COBOL programmer".
       PROGRAM-DONE.
           STOP RUN.
